print(f"""
 \033[1;96m ------------------------
 \033[1;32m < Hello -usar >
 \033[1;96m ------------------------
 \033[1;32m    _____    _____   _____
 \033[1;92m   |  _  \  |___  | |     |
 \033[1;91m   | |_| |     _| | | | | |
 \033[1;92m   |  _  /    |_  ] | | | |
 \033[1;93m   | | \ \   ___| | | |_| |
 \033[1;32m   |_|  \_\ |_____/ |_____/
 
\033[1;91m     ___   _       _____       ___   _   _        ___  ___
\033[1;93m    /   | | |     |___  |     /   | | | / /      /   |/   |
  \033[1;32m / /| | | |         / /    / /| | | |/ /      / /|   /| |
  \033[1;91m/ / | | | |        / /    / / | | | |\ \     / / |__/ | |
\033[1;32m / /  | | | |___    / /    / /  | | | | \ \   / /       | |
\033[1;93m/_/   |_| |_____|  /_/    /_/   |_| |_|  \_\ /_/        |_|
 
 
 
 \033[1;32m  
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
""")
print("""

 \033[1;32m ------------------------
 \033[1;96m (\033[1;91m1\033[1;96m) \033[1;93m YOUTUBE     \033[1;32m :  \033[1;93m  https://youtu.be/bEWFvu5QgK0
 
 \033[1;96m (\033[1;91m2\033[1;96m) \033[1;93m Telegram    \033[1;32m :  \033[1;93m  https://t.me/R3D_AC7AKM
 
 \033[1;96m (\033[1;91m1\033[1;96m) \033[1;93m Password   \033[1;32m  :  \033[1;93m  r3d
 
 \033[1;32m ------------------------

""")
import requests
import random
#رعد الحاكم

ID = input('[1] Enter ID :')
tok = input('[2] Enter Token : ')
i =int(input('[~] PABG : '))
for i in range(i):
 user = '1234567890'
 us = str(''.join((random.choice(user) for i in range(7))))
 username = '+20122' + us
 password = '0122' + us
 us4 = str(''.join((random.choice(user) for i in range(8))))
 tlg =(f'''https://api.telegram.org/bot{tok}/sendMessage?chat_id={ID}&text=ᯓ ʟᴏɢɪɴ » Facebook\n
🔱 • 𝙴𝚖𝚊𝚒𝚕 ☞{username}
🔱 • 𝙿𝚊𝚜𝚜𝚠𝚘𝚛𝚍 ☞ +{us4}
🔱 • 𝙲𝚘𝚞𝚗𝚝𝚛𝚢 ☞ Egypt
🔱 • 𝙲𝚘𝚍𝚎 ☞ +20 
🔱 • 𝒕𝒊𝒎𝒆 ☞ 2021-10-12
ᯓ R3d''')
 i = requests.post(tlg)